===================
Simple Declaration
===================

let a = 3;
let b = 5;
let c = a + b;

-------------------

(source_file
  (variable_declaration
    (variable_declarator
      (identifier)
      (literal
        (number))))
  (variable_declaration
    (variable_declarator
      (identifier)
      (literal
        (number))))
  (variable_declaration
    (variable_declarator
      (identifier)
      (binary_expression
        (identifier)
        (identifier)))))

===================
Simple Assignment
===================

let a = 10;
a = 5;
a = 5 * 2;

-------------------

(source_file
  (variable_declaration
    (variable_declarator
      (identifier)
      (literal
        (number))))
  (assignment
    (identifier)
    (literal
      (number)))
  (assignment
    (identifier)
    (binary_expression
      (literal
        (number))
      (literal
        (number)))))

===================
Multiple Declaration
===================

let a = 5, b = 3;
let c;

-------------------

(source_file
  (variable_declaration
    (variable_declarator
      (identifier)
      (literal
        (number)))
    (variable_declarator
      (identifier)
      (literal
        (number))))
  (variable_declaration
    (variable_declarator
      (identifier))))

===================
Function Declaration
===================

let sum2 = (a, b) => {
  return a + b;
};

-------------------

(source_file
  (variable_declaration
    (variable_declarator
      (identifier)
      (lambda_expression
        (parameters
          (identifier)
          (identifier))
        (statement_block
          (return_statement
            (binary_expression
              (identifier)
              (identifier))))))))

===================
Array Assignment
===================

let first = nums[0];
let nums[0] = first + 5;

-------------------

(source_file
  (variable_declaration
    (variable_declarator
      (identifier)
      (array_expression
        (identifier)
        (literal
          (number)))))
  (variable_declaration
    (variable_declarator
      (array_expression
        (identifier)
        (literal (number)))
      (binary_expression
        (identifier)
        (literal (number))))))
